---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.LeaderEnd
source: html/e6e365cc-fc8c-31e2-a604-14ecf78c6374.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.LeaderEnd Property

Specifies the leader end point, in model coordinates.
 The default value is null.
 When null, the end point will be the same as the Origin point,
 driven by the Station value.

## Syntax (C#)
```csharp
public XYZ LeaderEnd { get; set; }
```